---
kind: property
id: P:Autodesk.Revit.DB.Analysis.AnalysisResultSchema.Description
source: html/01f11dff-0195-b6fe-d617-2d475357017e.htm
---
# Autodesk.Revit.DB.Analysis.AnalysisResultSchema.Description Property

Description of analysis result in view

## Syntax (C#)
```csharp
public string Description { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - When setting this property: A non-optional argument was null